DataProcessors/СеансБариста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>СеансБариста</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ЦеныНаСегодня</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/СеансыБарист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СеансыБарист</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныПокупкиПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПокупкиПродажи</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/СеансБариста/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОткрытьСеанс(Команда)
	ДатаНачала = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСеанс(Команда)
	ОбработатьСеанс();	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСеанс()
	
	МЗ = РегистрыСведений.СеансыБарист.СоздатьМенеджерЗаписи();
	Ключ = РегистрыСведений.СеансыБарист.СоздатьКлючЗаписи(
		Новый Структура("Период,Сотрудник", НачалоДня(ДатаНачала), ПараметрыСеанса.ТекущийСотрудник));
	ЗаполнитьЗначенияСвойств(МЗ, Ключ);
	МЗ.Прочитать();
	
	Если Не МЗ.Выбран() Тогда	
		Набор = РегистрыСведений.СеансыБарист.СоздатьНаборЗаписей();
		Набор.Прочитать();
	
		Запись = Набор.Добавить();
		Запись.Период = НачалоДня(ТекущаяДата());
		Запись.Сотрудник = ПараметрыСеанса.ТекущийСотрудник;
		Запись.ДатаНачала = ДатаНачала;
		Запись.ДатаОкончания = ТекущаяДата();
	
		Набор.Записать();
	Иначе
		МЗ.ДатаОкончания = ТекущаяДата();
		МЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если ПараметрыСеанса.ТекущийСотрудник.Пустая() Тогда
		Отказ = Истина;
		Сообщить("Невозможно открыть, для текущего пользователя нет сотрудника");
		Возврат;
	КонецЕсли;
	
	ОбновитьЦеныНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦены(Команда)
	ОбновитьЦеныНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьЦеныНаСервере()
	
	Объект.ЦеныНаСегодня.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныПокупкиПродажиСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныПокупкиПродажиСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныПокупкиПродажи.СрезПоследних(&ДатаСреза) КАК ЦеныПокупкиПродажиСрезПоследних
		|ГДЕ
		|	ЦеныПокупкиПродажиСрезПоследних.Номенклатура ССЫЛКА Справочник.Товары";
	
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Строка = Объект.ЦеныНаСегодня.Добавить();
			Строка.Товар = ВыборкаДетальныеЗаписи.Номенклатура;
			Строка.цена = ВыборкаДетальныеЗаписи.Цена;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры
